Repository: LevKulikov/FinanceTracker
Catalog: FinanceTracker/Localizable.xcstrings
Source language: en
Languages: ru

source: and currency
ru: и валюта

source: __Finance Tracker__ Version: %@
ru: __Финансовый Трекер__ Версия: %@

source: Add
ru: Добавить

source: Add %@
ru: Добавить %@

source: Add budget
ru: Добавить бюджет

source: Add new
ru: Новый

source: Add tag
ru: Добавить тег

source: Additional tabs
ru: Дополнительные вкладки

source: Again, this action is irretable. Do you want to delete all transactions?
ru: Еще раз, данное действие безвозвратное. Хотите удалить все транзакции?

source: Again, this action is irretable. If you are concerned about privacy, your data is stored only on your device. Do you want to delete all stored data?
ru: Еще раз, данное действие безвозвратное. Если вы беспокоитесь безопасности своих данных, то уверяем, что ваши данные хранятся исключительно на вашем устройстве. Хотите удалить все сохраненные данные?

source: All
ru: Все

source: All categories
ru: Все категории

source: All Categories
ru: Все категории

source: All Icons
ru: Все иконки

source: All stored data will be deleted and replaced with imported data, even it is empty
ru: Все сохраненные данные будут удалены и заменены на импортированные, даже если импортированный файл не содержит значений

source: All time
ru: Все время

source: An error occurred during creating a Excel (csv) file. Error text: %@
ru: Случилась ошибка при создании файла Excel (csv). Текст ошибки: %@

source: An error occurred during decoding selected file. Error text: %@
ru: Произошла ошибка в процессе декодирования файла. Текст ошибки: %@

source: An error occurred during decoding selected file. Error text: %@. Probably, you selected wrong file
ru: Произошла ошибка в процессе декодирования файла. Текст ошибки: %@. Возможно, вы выбрали не тот файл

source: An error occurred while creating a JSON file. Error text: %@
ru: Случилась ошибка при создания JSON файла. Текст ошибки: %@

source: Analytics
ru: Аналитика

source: Any text or number
ru: Любой текст или число

source: App and Data
ru: Приложение и данные

source: Appearance
ru: Внешний вид

source: Are you sure? All stored data (transactions, balance accounts, categories etc.) will be deleted, this action is irretable Your can delete only transactions if you would like
ru: Вы уверены? Все данные (транзакции, счета, категории и т.д.) будут безвозвратно удалены Вы можете удалить только транзакции, если желаете

source: Are you sure? All stored data (transactions, balance accounts, categories, tags) will be deleted, this action is irretable Your can delete only transactions if you would like
ru: Вы уверены? Все данные (транзакции, счета, категории, теги) будут безвозвратно удалены Вы можете удалить только транзакции, если желаете

source: Are you sure? All transactions will be deleted, this action is irretable
ru: Вы уверены? Все транзакции будут удалены, данное действие безвозвратно

source: Back
ru: Назад

source: Balance account
ru: Счет

source: Balance Account
ru: Счет

source: Balance account name
ru: Имя счета

source: Balance account picker
ru: Пикер счета

source: Balance Accounts
ru: Счета

source: Bar chart
ru: Гистограмма

source: Bar chart date sride type picker
ru: Пикер шага данных гистограммы

source: Bar chart picker
ru: Пикер гистограммы

source: Both types
ru: Оба типа

source: Budget
ru: Бюджет

source: Budget name
ru: Имя бюджета

source: Budget name (Optional)
ru: Имя бюджета (Опционально)

source: Budget period
ru: Пикер бюджета

source: Budget total
ru: Сумма бюджета

source: Budgets
ru: Бюджеты

source: Cancel
ru: Отменить

source: Cancel the import?
ru: Отменить импорт?

source: Card type
ru: Тип карточки

source: Categories
ru: Категории

source: Category
ru: Категория

source: Category is not selected
ru: Категория не выбрана

source: Category name
ru: Имя категории

source: Charts
ru: Графики

source: Check other items using the picker at the top
ru: Посмотрите другие объекты с помощью пикера вверху

source: Check the spelling and enter the query in English
ru: Проверьте написание и вводите запрос на английском

source: Clear selection
ru: Очистить выбор

source: Click here
ru: Нажмите здесь

source: Close
ru: Закрыть

source: Code source
ru: Репозиторий

source: Color
ru: Цвет

source: Color for tag
ru: Цвет тега

source: Comment
ru: Комментарий

source: Comment: %@
ru: Комментарий: %@

source: Completely open source, all information is stored on your device. No need to worry about privacy!
ru: Полностью открытый код, все данные хранятся исключительно на вашем устройстве. Нет причин для беспокойства о приватности!

source: Continue
ru: Продолжить

source: Copy email
ru: Копировать email

source: Copy username
ru: Копировать имя пользователя

source: Create
ru: Создать

source: Create tag
ru: Создать тег

source: Create your balance account to start
ru: Создайте ваш счет чтобы начать пользоваться приложением

source: Currencies
ru: Валюты

source: Currency name or code
ru: Имя или код валюты

source: Current balance
ru: Текущий баланс

source: Current date
ru: Текущая дата

source: Daily reminder
ru: Ежедневное напоминание

source: Dark mode
ru: Темный режим

source: Data settings
ru: Настройки данных

source: Date
ru: Дата

source: Date range
ru: Промежуток дат

source: Date type
ru: Тип даты

source: Date;Time;Type;Value;Currency;Category;Balance Account;Comment;Tags
ru: Дата;Время;Тип;Значение;Валюта;Категория;Счет;Комментарий;Теги

source: default
ru: базовый

source: Default color
ru: Базовый цвет

source: Default filters
ru: Дефолтные фильтры

source: Delete
ru: Удалить

source: Delete all data?
ru: Удалить все данные?

source: Delete all stored data
ru: Удалить все сохраненные данные

source: Delete all transactions
ru: Удалить все транзакции

source: Delete all transactions?
ru: Удалить все транзакции?

source: Delete balance account?
ru: Удалить счет?

source: Delete budget?
ru: Удалить бюджет?

source: Delete category only
ru: Удалить только категорию

source: Delete category?
ru: Удалить категорию?

source: Delete only balance account
ru: Удалить только счет

source: Delete tag only
ru: Удалить только тег

source: Delete tag?
ru: Удалить тег?

source: Delete transaction?
ru: Удалить транзакцию?

source: Delete transactions in the group
ru: Удалить транзакции в группе

source: Delete transactions?
ru: Удалить транзакции?

source: Delete with transactions
ru: Удалить вместе с транзакциями

source: Developer
ru: Разработчик

source: Developer tool
ru: Инструмент разработчика

source: Different currency
ru: Разные валюты

source: Don't forget to add your spendings
ru: Не забудьте добавить свои расходы

source: Done
ru: Готово

source: Drag and drop to reorder
ru: Перетащите чтобы переставить

source: Drag to reorder
ru: Удерживайте чтобы упорядочить

source: Easily add your expenses and income
ru: С легкостью добавляйте ваши расходы и доходы

source: Education
ru: Образование

source: Empty
ru: Пустой

source: End date
ru: Конечная дата

source: Enter comment
ru: Введите комментарий

source: Enter name here
ru: Введите имя

source: Enter number
ru: Введите количество

source: Entertainments
ru: Развлечения

source: Entities
ru: Сущности

source: Epty
ru: Пустой

source: Err
ru: Ошбк

source: Excel (csv) file creation error
ru: Ошибка создания Excel (csv) файла

source: Export all data
ru: Экспортировать все данные

source: Export all data as JSON file
ru: Экспортировать данные в виде JSON файла

source: Export transactions as Excel file (csv) for date range
ru: Экспортировать транзакции в виде Excel файла (csv) за промежуток дат

source: Family
ru: Семья

source: File decoding error
ru: Ошибка декодирования файла

source: Filters
ru: Фильтры

source: Final alert!
ru: Последнее предупреждение!

source: Finances are important
ru: Финансы это важно

source: First step
ru: Первый шаг

source: For a day
ru: День

source: For a month
ru: Месяц

source: For a week
ru: Неделя

source: For a year
ru: Год

source: For all categories
ru: Для всех категорий

source: Forward
ru: Вперед

source: From
ru: Из

source: Gifts
ru: Подарки

source: Graphs
ru: Графики

source: Groceries
ru: Продукты

source: Health
ru: Здоровье

source: Hide
ru: Скрыть

source: Home
ru: Дом

source: Icon
ru: Иконка

source: Import
ru: Импортировать

source: Import data from JSON file
ru: Импортировать данные из JSON файла

source: Import data?
ru: Импортировать данные?

source: Imported data will be cleaned
ru: Импортированные данные будут очищены

source: Imported objects
ru: Импортированные объекты

source: In development
ru: В разработке

source: Income
ru: Доход

source: Initial balance
ru: Стартовый баланс

source: Insert
ru: Вставить

source: Interest
ru: Проценты

source: It is good opportunity to try!
ru: Хорошая возможность чтобы попробовать!

source: JSON creation error
ru: Ошибка создания JSON файла

source: Light mode
ru: Светлый режим

source: List
ru: Список

source: More
ru: Больше

source: Move and delete
ru: Переместить и удалить

source: Move transactions
ru: Переместить транзакции

source: Name
ru: Имя

source: New balance account
ru: Новый счет

source: New budget
ru: Новый бюджет

source: New category
ru: Новая категория

source: Next
ru: Дальше

source: No %@ for this date
ru: Нет транзакций типа %@ на указанную дату

source: No balance accounts imported
ru: Нет импортированных счетов

source: No budgets
ru: Нет бюджетов

source: No budgets imported
ru: Нет импортированных бюджетов

source: No categories imported
ru: Нет импортированных категорий

source: No currencies with "%@"
ru: Нет валют, содержащих "%@"

source: No results for "%@"
ru: Нет результатов для "%@"

source: No tags imported
ru: Нет импортированных тегов

source: No transactions
ru: Нет транзакций

source: No transactions imported
ru: Нет импортированных транзакций

source: No, cancel
ru: Нет, отменить

source: No, stay here
ru: Нет, остаться здесь

source: Nothing here yet
ru: Здесь пока пусто

source: Notifications
ru: Уведомления

source: Of type
ru: Типа

source: One day date picker
ru: Пикер конкретного дня

source: One day picker
ru: Пикер конкретного дня

source: Open
ru: Открыть

source: Open source
ru: Открытый код

source: Other
ru: Другое

source: Per day
ru: По дням

source: Per month
ru: По месяцам

source: Per week
ru: По неделям

source: Per year
ru: По годам

source: Picker title
ru: Заголовок пикера

source: Pie chart
ru: Диаграмма

source: Pie chart date type picker
ru: Пикер дат для круговой диаграммы

source: Pie chart picker
ru: Пикер круговой диаграммы

source: Please select any setting in the left-hand menu
ru: Пожалуйста, выберите любую секцию настроек в меню слева

source: Please wait
ru: Пожалуйста, ожидайте

source: Preview
ru: Превью

source: Profit
ru: Прибыль

source: Random color
ru: Случайный цвет

source: Random color by default
ru: Случайный цвет по дефолту

source: Refresh
ru: Обновить

source: Refresh?
ru: Обновить?

source: Reminder body
ru: Текст напоминания

source: Reminder time
ru: Время напоминания

source: Reminder title
ru: Заголовок напоминания

source: Reorder
ru: Переставить

source: Reorder tabs
ru: Упорядочить вкладки

source: Replace and delete
ru: Переставить и удалить

source: Salary
ru: Зарплата

source: Save
ru: Сохранить

source: Scroll to get more info
ru: Пролистайте для большей информации

source: Search
ru: Поиск

source: Search or add tag
ru: Искать или добавить тег

source: Select
ru: Выбрать

source: Select balance account
ru: Выберите счет

source: Select category
ru: Выберите категорию

source: Select color
ru: Выберите цвет

source: Select date for bars
ru: Выбрать промежуток для столбцов

source: Select date type
ru: Выбрать тип даты

source: Select displayed transactions
ru: Выбрать отображаемые транзакции

source: Select transaction type
ru: Выбрать тип транзакций

source: Selected (%1$@) and Default (%2$@) balance accounts have different currency. Moved transactions will change currency to %3$@. Continue?
ru: Выбранный (%1$@) и Дефолтный (%2$@) счета имеют разные валюты. Валюта будет изменена для перемещенных транзакций на %3$@. Продолжить?

source: Send mail
ru: Отправить письмо

source: Send message
ru: Отправить сообщение

source: Set as default
ru: Установить как базовый

source: Set the default balance account first
ru: Сначала установите базовый счет

source: Setting
ru: Настройки

source: Setting is not selected
ru: Секция настроек не выбрана

source: Settings
ru: Настройки

source: Show less
ru: Меньше

source: Show more filter
ru: Больше фильтров

source: Show transactions
ru: Показать транзакции

source: Simple
ru: Просто

source: Skip
ru: Пропустить

source: Some existing categories
ru: Некоторые существующие категории

source: Some information cannot be previewed until the imported data is saved to the device. After saving, all information will be available for viewing and editing
ru: Некоторую информацию невозможно отобразить в превью до того, как ипортированные данные будут сохранены на устройство. После сохранения вся информация будет доступна для просмотра и редактирования

source: Some save error happened
ru: Произошла некая ошибка сохранения

source: Some save error occured
ru: Случилась ошибка при сохранении

source: Sorry, some error occured. This page doesn't exist
ru: Извините, произошла неизвестная ошибка. Данная страница не существует

source: Spending
ru: Расход

source: Spendings
ru: Расходы

source: Spent
ru: Потрачено

source: Start date
ru: Начальная дата

source: Statistics
ru: Статистика

source: Stored data
ru: Сохраненные данные

source: Sum of transactions
ru: Сумма транзакций

source: System mode
ru: Режим системы

source: Tabs placements
ru: Разположение вкладок

source: Tag name
ru: Имя тега

source: Tag total
ru: Сумма по тегу

source: Tags
ru: Теги

source: Tags and comment
ru: Теги и комментарий

source: Tags stats
ru: Данные по тегам

source: There are no saved transactions for this date
ru: Нет сохраненных транзакций на выбранную дату

source: There is not a matching transaction
ru: Нет подходящих транзакций

source: This action is irretable
ru: Данное действий безвозвратно

source: This action is irretable. There are two ways to delete: - Delete category only: all transactions binded to deleted category will be moved to another one of your choice. Before deletion app will ask you where transactions should be moved to - Delete with transactions: category and binded to it transactions will be deleted all together
ru: Данное действий безвозвратно. Есть несколько вариантов удаления: - Удалить только категорию: все транзакции, привязанные к данной категории, будут перенесены в другую на ваш выбор. Перед удалением приложение спросит в какую категорию переместить транзакции - Удалить вместе с транзакциями: категория и все привязанные к ней транзакции будут удалены

source: This action is irretable. There are two ways to delete: - Delete only balance account: all transactions binded to deleted balance account will be moved to default one - Delete with transactions: balance account and binded to this account transactions will be deleted
ru: Данное действий безвозвратно. Есть несколько вариантов удаления: - Удалить только счет: все привязанные к счету транзакции будут перемещены в дефолтный счет - Удалить вместе с транзакциями: счет и все привязанные к нему транзакции будут удалены

source: This action is irretable. There are two ways to delete: - Delete tag only: only selected tag will be deleted and removed from transactions - Delete with transactions: tag and transactions marked with this tag will be deleted all together
ru: Данное действий безвозвратно. Есть несколько вариантов удаления: - Удалить только тег: тег будет удален и убран из транзакций - Удалить вместе с транзакциями: тег и все привязанные к нему транзакции будут удалены

source: This screen refreshes by itself automatically, so you don't need to do it manually. But if you don't see needed changes, press button to refresh
ru: Данный экран обновляется автоматически, так что нет необходимости делать это вручную. Но, если вы не видите нужных изменений, нажмите кнопку ниже чтобы обновить

source: This window is used to test the App performance during high loading. It creates bench of transactions (default it is 5000) for a selected Balance Account and Category. All transactions are created for the current date, so __do not push the button "Insert"__ if you don't want to dramatically slow down the App
ru: Данное окно используется для теста производительности приложения в процессе высокой нагрузки. Оно создает огромное количество транзакций (базово 5000) для выбранных Счета и Категории. Все транзакции создаются на текущую дату, так что __не нажимайте кнопку "Вставить"__ если вы не хотите сильно замедлить приложение

source: Time, Title and Body
ru: Время, Заголовок и Текст

source: To
ru: В

source: Total
ru: Итого

source: Total balance
ru: Баланс

source: Total value
ru: Итого

source: Track your finances with customizable graphs
ru: Отслеживайте ваши финансы с настраиваемыми графиками

source: Transaction
ru: Транзакция

source: Transaction type
ru: Тип транзакции

source: Transaction type for tags picker
ru: Тип транзакции для пикера тегов

source: Transactions
ru: Транзакции

source: Transport
ru: Транспорт

source: Try searching for other items using the picker at the top
ru: Попробуйте поискать другие объекты с помощью пикера вверху

source: Type
ru: Тип

source: Type picker
ru: Пикер типов

source: Unable to delete
ru: Невозможно удалить

source: Unable to delete default balance account. Set an another balance account as default if you need to delete the selected one
ru: Невозможно удалить базовый счет. Установите другой счет в качестве базового, если вам необходимо удалить выбранный счет

source: Unknown
ru: Неизвестно

source: Unknown error
ru: Неизвестная ошибка

source: Update
ru: Обновить

source: Update category
ru: Обновить категорию

source: Updating text field
ru: Обновления текста

source: USD
ru: RUB

source: Value cannot be zero or empy
ru: Значение не может быть нулем или пустым

source: Value of each transaction will be equal to the number entered
ru: Значение каждой транзакции будет равно введенному количеству

source: Week
ru: Неделя

source: Week picker
ru: Пикер недели

source: Welcome
ru: Добро пожаловать

source: Why I don't see some information
ru: Почему я не вижу некоторую информацию

source: Yes, cancel
ru: Да, отменить

source: Yes, delete
ru: Да, удалить

source: Yes, delete anyway
ru: Да, удалить в любом случае

source: Yes, refresh
ru: Да, обновить

source: You do not have %@ with tags
ru: У вас нет транзакций типа %@ с тегами

source: You do not have any saved tag.
ru: У вас нет сохраненных тегов.

source: You don't have any saved budgets yet. Good opportunity to give it a try!
ru: У вас пока нет сохраненных бюджетов. Хорошая возможность попробовать!

source: You have prevented the application from sending notifications. %@ to go to Settings and allow notifications to be sent.
ru: Вы запретили приложению отправлять уведомления. %@ чтобы перейти в Настройки и разрешить отправку уведомлений

source: Сafes
ru: Кафе
